In [1]:
import pandas as pd
import numpy as np

In [5]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2['a']

-5

In [13]:
obj2['d']

4

In [17]:
obj2[['d', 'b', 'a']]

d    4
b    7
a   -5
dtype: int64

In [19]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [21]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [23]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [25]:
'b' in obj2

True

In [27]:
'e' in obj2

False

In [41]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [43]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [49]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [53]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [55]:
pd.isna(obj3)

Ohio      False
Texas     False
Oregon    False
Utah      False
dtype: bool

In [57]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [59]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [61]:
obj4.notna()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [63]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [65]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [67]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [69]:
obj.index =['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [71]:
data = {
    'state' : ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year' : [2000, 2001, 2002, 2001, 2002, 2003],
    'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [73]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [75]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [79]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [81]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [83]:
frame2['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [87]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [91]:
frame2[['year', 'state']]

   year   state
0  2000    Ohio
1  2001    Ohio
2  2002    Ohio
3  2001  Nevada
4  2002  Nevada
5  2003  Nevada

In [93]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [97]:
frame2.loc[:,'state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [99]:
frame2.loc[:, ['state', 'pop']]

    state  pop
0    Ohio  1.5
1    Ohio  1.7
2    Ohio  3.6
3  Nevada  2.4
4  Nevada  2.9
5  Nevada  3.2

In [101]:
frame2.loc[[1,3]]

   year   state  pop debt
1  2001    Ohio  1.7  NaN
3  2001  Nevada  2.4  NaN

In [103]:
frame2.loc[[1,3], ['state', 'pop']]

    state  pop
1    Ohio  1.7
3  Nevada  2.4

In [105]:
frame2.iloc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [107]:
frame2.iloc[[1,3]]

   year   state  pop debt
1  2001    Ohio  1.7  NaN
3  2001  Nevada  2.4  NaN

In [113]:
frame2.iloc[:,1]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [115]:
frame2.iloc[1,1]

'Ohio'

In [119]:
frame2['debt'] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [123]:
frame2['debt'] = np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [129]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [133]:
frame2['eastern'] = frame2['state'] == 'Ohio'
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [143]:

frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [151]:
populations = {
    'Ohio' : {2000: 1.5, 2001: 1.7, 2002:3.6},
    'Nevada' : {2001: 2.4, 2002: 2.9}
}

frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [153]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [155]:
pdata = {
    'Ohio' : frame3['Ohio'][:-1],
    'Nevada' : frame3['Nevada'][:2]
}

frame4 = pd.DataFrame(pdata)
frame4

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [157]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [159]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [161]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [169]:
obj = pd.Series(np.arange(3), index=['a', 'b', 'c'])
index = obj.index
index[1:]

Index(['b', 'c'], dtype='object')

In [171]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [173]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [175]:
obj2.index is labels

True

In [179]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [181]:
'Ohio' in frame3.columns

True

In [183]:
2002 in frame3.index

True

In [185]:
2003 in frame3.index

False

In [187]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [193]:
obj1 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj1

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [199]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [201]:
obj3.reindex(np.arange(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [206]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [208]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [210]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [214]:
obj.drop(['c', 'a'])

b    1.0
d    3.0
e    4.0
dtype: float64

In [218]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), 
             index = ['Ohio', 'Colorado', 'Utah', 'New York'],
             columns = ['one', 'two', 'three', 'four']
            )
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [220]:
data.drop(['Ohio', 'Utah'])

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [222]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [224]:
data.drop(columns = ['two'])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [228]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [232]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [235]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [241]:
obj.loc[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [243]:
obj1 = pd.Series([1,2,3], index=[2,0,1])
obj2 = pd.Series([1,2,3], index=['a', 'b', 'c'])

In [245]:
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [247]:
obj2[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [249]:
obj1.iloc[[0,1,2]]

2    1
0    2
1    3
dtype: int64

In [255]:
obj2.iloc[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [257]:
obj1.loc[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [263]:
obj2.loc['a':'c']

a    1
b    2
c    3
dtype: int64

In [265]:
obj2.loc[['a', 'c']]

a    1
c    3
dtype: int64

In [269]:
obj2.loc['b':'c'] = 5
obj2

a    1
b    5
c    5
dtype: int64

In [271]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
             index=['Ohio', 'Colorado', 'Utah','New York'],
             columns=['one', 'two', 'three', 'four']
            )
frame

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [273]:
frame['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [275]:
frame[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [277]:
data = frame
data.loc['Colorado']

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [279]:
data.loc[['Colorado', 'New York']]

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [281]:
data.loc['Colorado', ['two', 'four']]

two     5
four    7
Name: Colorado, dtype: int32

In [283]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [287]:
data.iloc[[2,1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    4    5      6     7

In [289]:
data.iloc[[2,1], [3,0,1]]

          four  one  two
Utah        11    8    9
Colorado     7    4    5

In [291]:
ser = pd.Series(np.arange(4))
ser

0    0
1    1
2    2
3    3
dtype: int32

In [295]:
ser.iloc[-1]

3

In [301]:
ser.iloc[-1]

3

In [303]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [309]:
data.loc[data.three == 6, 'three'] = 11
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5     11     7
Utah        8    9     10    11
New York   12   13     14    15

In [319]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [321]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [323]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [325]:
d1 = pd.DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])
d2 = pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
d1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [327]:
d2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [329]:
d1 + d2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [333]:
d1= pd.DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
d2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))
d2.loc[1,'b'] = np.nan

In [335]:
d1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [338]:
d2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [340]:
d1 + d2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [342]:
d1.add(d2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [344]:
arr = np.arange(12.).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [346]:
arr[0]

array([0., 1., 2., 3.])

In [348]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [352]:
f1 = pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), index=['Utah', 'Ohio', 'Taxas', 'Oregon'])
series = f1.iloc[0]
f1

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Taxas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [354]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [356]:
f1 - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Taxas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [358]:
s2 = pd.Series(np.arange(3), index=['b', 'e', 'f'])
s2

b    0
e    1
f    2
dtype: int32

In [360]:
f1 + s2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Taxas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [364]:
s3 = f1['d']
s3

Utah       1.0
Ohio       4.0
Taxas      7.0
Oregon    10.0
Name: d, dtype: float64

In [366]:
f1

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Taxas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [368]:
f1.sub(s3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Taxas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [370]:
frame = pd.DataFrame(np.random.standard_normal((4,3)), columns=list('bde'), index=['Utah', 'Ohio', 'Taxas', 'Oregon'])
frame

               b         d         e
Utah   -0.471358 -1.698760 -0.327298
Ohio   -0.758597 -0.042617 -0.320570
Taxas   0.395585 -2.487258  0.428752
Oregon -1.644343 -0.382429 -0.693852

In [372]:
np.abs(frame)

               b         d         e
Utah    0.471358  1.698760  0.327298
Ohio    0.758597  0.042617  0.320570
Taxas   0.395585  2.487258  0.428752
Oregon  1.644343  0.382429  0.693852

In [376]:
def f1(x):
    return x.max() - x.min()

frame.apply(f1)

b    2.039929
d    2.444641
e    1.122604
dtype: float64

In [378]:
frame.apply(f1, axis='columns')

Utah      1.371463
Ohio      0.715979
Taxas     2.916010
Oregon    1.261914
dtype: float64

In [380]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f2)

            b         d         e
min -1.644343 -2.487258 -0.693852
max  0.395585 -0.042617  0.428752

In [384]:
obj = pd.Series(np.arange(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int32

In [386]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [388]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [390]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [392]:
frame.sort_index(axis='columns')

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [394]:
frame.sort_index(axis='columns', ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [396]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [400]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [404]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [408]:
frame = pd.DataFrame({
    'b' : [4.3, 7, -3, 2], 
    'a' : [0, 1, 0, 1],
    'c' : [-2, 5, 8, -2.5]
})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [413]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [417]:
obj = pd.Series(np.arange(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [419]:
obj.index.is_unique

False

In [421]:
obj['a']

a    0
a    1
dtype: int32

In [423]:
obj['c']

4

In [425]:
df = pd.DataFrame(np.random.standard_normal((5,3)), index=['a', 'a', 'b', 'b', 'c'])
df

          0         1         2
a -0.165161 -1.351896  0.298224
a  0.225746  2.069046 -0.899715
b  0.543132  0.648151 -0.374341
b  0.576359 -0.053532 -1.000274
c  0.547508  1.076188 -0.529949

In [427]:
df.loc['b']

          0         1         2
b  0.543132  0.648151 -0.374341
b  0.576359 -0.053532 -1.000274

In [429]:
df.loc['c']

0    0.547508
1    1.076188
2   -0.529949
Name: c, dtype: float64

In [431]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=['a', 'b', 'c', 'd'],
             columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [433]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [435]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [437]:
df.sum(axis='index', skipna=False)

one   NaN
two   NaN
dtype: float64

In [439]:
df.mean(axis='columns')

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [443]:
df.idxmax()

one    b
two    d
dtype: object

In [445]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [447]:
df.idxmin()

one    d
two    b
dtype: object

In [449]:
obj = pd.Series(['a', 'b', 'a', 'c']*4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [453]:
price = pd.read_pickle(r'C:\Users\user\Lesson\pydata-book-3rd-edition\examples\yahoo_price.pkl')
volume = pd.read_pickle(r'C:\Users\user\Lesson\pydata-book-3rd-edition\examples\yahoo_volume.pkl')

In [459]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [461]:
returns['MSFT'].corr(returns['IBM'])

0.4997636114415114

In [463]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [465]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [475]:
from lxml import objectify

with open(r'C:\Users\user\Lesson\pydata-book-3rd-edition\datasets\mta_perf\Performance_MNR.xml') as f:
    parsed = objectify.parse(f)

root = parsed.getroot()
data= []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data={}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

perf = pd.DataFrame(data)
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [479]:
perf2 = pd.read_xml(r'C:\Users\user\Lesson\pydata-book-3rd-edition\datasets\mta_perf\Performance_MNR.xml')
perf2.head()

,INDICATOR_SEQ,PARENT_SEQ,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,U,%,1,95.00,96.90,95.00,96.90
1,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,U,%,1,95.00,96.00,95.00,95.00
2,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,U,%,1,95.00,96.30,95.00,96.90
3,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,U,%,1,95.00,96.80,95.00,98.30
4,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,U,%,1,95.00,96.60,95.00,95.80

In [481]:
string_data = pd.Series(['aardvark', np.nan, None, 'avocado'])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [483]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [485]:
float_data = pd.Series([1, 2, None], dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [487]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [491]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [493]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [497]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [499]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [501]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [505]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [507]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [509]:
data.dropna(axis = 'columns', how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [511]:
df = pd.DataFrame(np.random.standard_normal((7,3)))
df

          0         1         2
0  1.643802 -0.381586  0.775640
1 -0.239249  1.186607  0.429094
2  0.746304 -0.792785  0.731924
3  1.062383 -1.922036 -1.085703
4 -0.930123  0.009733  0.150335
5 -0.892705  1.309309  0.211871
6  0.129338  1.555478  0.577829

In [513]:
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  1.643802       NaN       NaN
1 -0.239249       NaN       NaN
2  0.746304       NaN  0.731924
3  1.062383       NaN -1.085703
4 -0.930123  0.009733  0.150335
5 -0.892705  1.309309  0.211871
6  0.129338  1.555478  0.577829

In [515]:
df.dropna()

          0         1         2
4 -0.930123  0.009733  0.150335
5 -0.892705  1.309309  0.211871
6  0.129338  1.555478  0.577829

In [517]:
df.dropna(thresh=2)

          0         1         2
2  0.746304       NaN  0.731924
3  1.062383       NaN -1.085703
4 -0.930123  0.009733  0.150335
5 -0.892705  1.309309  0.211871
6  0.129338  1.555478  0.577829

In [519]:
df.fillna(0)

          0         1         2
0  1.643802  0.000000  0.000000
1 -0.239249  0.000000  0.000000
2  0.746304  0.000000  0.731924
3  1.062383  0.000000 -1.085703
4 -0.930123  0.009733  0.150335
5 -0.892705  1.309309  0.211871
6  0.129338  1.555478  0.577829

In [521]:
df.fillna({1:0.5, 2:0})

          0         1         2
0  1.643802  0.500000  0.000000
1 -0.239249  0.500000  0.000000
2  0.746304  0.500000  0.731924
3  1.062383  0.500000 -1.085703
4 -0.930123  0.009733  0.150335
5 -0.892705  1.309309  0.211871
6  0.129338  1.555478  0.577829

In [523]:
df = pd.DataFrame(np.random.standard_normal((6,3)))
df

          0         1         2
0  0.433704  1.488208 -0.733370
1 -0.786407  0.654750 -0.777761
2 -0.769823  0.585873 -0.589002
3 -1.174099 -1.079959 -0.933824
4  1.778815 -0.021229 -2.120234
5 -0.201449 -0.089565 -0.532780

In [527]:
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  0.433704  1.488208 -0.733370
1 -0.786407  0.654750 -0.777761
2 -0.769823       NaN -0.589002
3 -1.174099       NaN -0.933824
4  1.778815       NaN       NaN
5 -0.201449       NaN       NaN

In [529]:
df.fillna(method='ffill')

          0         1         2
0  0.433704  1.488208 -0.733370
1 -0.786407  0.654750 -0.777761
2 -0.769823  0.654750 -0.589002
3 -1.174099  0.654750 -0.933824
4  1.778815  0.654750 -0.933824
5 -0.201449  0.654750 -0.933824

In [531]:
df.fillna(method='bfill')

          0         1         2
0  0.433704  1.488208 -0.733370
1 -0.786407  0.654750 -0.777761
2 -0.769823       NaN -0.589002
3 -1.174099       NaN -0.933824
4  1.778815       NaN       NaN
5 -0.201449       NaN       NaN

In [533]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.433704  1.488208 -0.733370
1 -0.786407  0.654750 -0.777761
2 -0.769823  0.654750 -0.589002
3 -1.174099  0.654750 -0.933824
4  1.778815       NaN -0.933824
5 -0.201449       NaN -0.933824

In [535]:
data = pd.DataFrame({
    'k1' : ['one', 'two']*3 + ['two'],
    'k2' : [1,1,2,3,3,4,4,]
})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [537]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [539]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [543]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [545]:
data.drop_duplicates(subset=['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [547]:
data.drop_duplicates(subset=['k2'])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [549]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [9]:
fruits = ['apple', 'orange', 'apple', 'apple']*2
N=len(fruits)
rng=np.random.default_rng(seed=12345)
df = pd.DataFrame(
    {
        'fruit' : fruits,
        'basket_id' : np.arange(N),
        'count' : rng.integers(3, 15, size=N),
        'weight' : rng.uniform(0, 4, size=N)
    },
    columns = ['basket_id', 'fruit', 'count', 'weight']
)
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [11]:
fruit_cat = df['fruit'].astype('category')
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [15]:
c = fruit_cat.array
type(c)

pandas.core.arrays.categorical.Categorical

In [17]:
c.categories

Index(['apple', 'orange'], dtype='object')

In [19]:
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [21]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [25]:
df['fruit'] = df['fruit'].astype('category')
df['fruit']

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [27]:
my_cat = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])
my_cat

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [29]:
categories = ['foo', 'bar', 'baz']
codes = [0, 1,2,0,0,1,]
my_cat2 = pd.Categorical.from_codes(codes, categories)
my_cat2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [31]:
ordered_cat = pd.Categorical.from_codes(codes, categories, ordered=True)
ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [37]:
rng = np.random.default_rng(seed=12345)
draws = rng.standard_normal(1000)
draws[:5]
bins = pd.qcut(draws, 4)
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [41]:
bins = pd.qcut(draws, 4, labels=['q1', 'q2', 'q3', 'q4'])
bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

In [43]:
bins = pd.Series(bins, name='quartile')
results =(pd.Series(draws).groupby(bins).agg(['count', 'min', 'max']).reset_index())
results

  quartile  count       min       max
0       q1    250 -3.119609 -0.678494
1       q2    250 -0.673305  0.008009
2       q3    250  0.018753  0.686183
3       q4    250  0.688282  3.211418

In [45]:
results['quartile']

0    q1
1    q2
2    q3
3    q4
Name: quartile, dtype: category
Categories (4, object): ['q1' < 'q2' < 'q3' < 'q4']

In [49]:
N=10_000_000
labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N//4))
categories = labels.astype('category')
labels.memory_usage(deep=True)

520000132

In [53]:
categories.memory_usage(deep=True)

10000512

In [55]:
time _ = labels.astype('category')

CPU times: total: 359 ms
Wall time: 355 ms

In [57]:
%timeit labels.value_counts()

300 ms  4.29 ms per loop (mean  std. dev. of 7 runs, 1 loop each)

In [59]:
%timeit categories.value_counts()

32.8 ms  620 s per loop (mean  std. dev. of 7 runs, 10 loops each)

In [61]:
s = pd.Series(['a', 'b', 'c', 'd']*2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [63]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [65]:
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [69]:
actual_cat = ['a', 'b', 'c', 'd', 'e']
cat_s2 = cat_s.cat.set_categories(actual_cat)
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [71]:
cat_s.value_counts()

a    2
b    2
c    2
d    2
dtype: int64

In [73]:
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
dtype: int64

In [77]:
data = pd.Series(np.random.uniform(size=9),
          index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
          [1, 2, 3, 1, 3, 1, 2, 2, 3]]
         )
data

a  1    0.168894
   2    0.392927
   3    0.382050
b  1    0.028422
   3    0.836517
c  1    0.464528
   2    0.610743
d  2    0.446879
   3    0.353166
dtype: float64

In [79]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [81]:
data['b']

1    0.028422
3    0.836517
dtype: float64

In [83]:
data['b':'c']

1    0.028422
3    0.836517
1    0.464528
2    0.610743
dtype: float64

In [85]:
data.loc[['b', 'd']]

b  1    0.028422
   3    0.836517
d  2    0.446879
   3    0.353166
dtype: float64

In [87]:
data.loc[:, 2]

a    0.392927
c    0.610743
d    0.446879
dtype: float64

In [89]:
data.unstack()

          1         2         3
a  0.168894  0.392927  0.382050
b  0.028422       NaN  0.836517
c  0.464528  0.610743       NaN
d       NaN  0.446879  0.353166

In [95]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
             index = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
             columns =[['Ohio', 'Ohio', 'Colorado'],
                       ['Green', 'Red', 'Green']]
                        )
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [99]:
frame.index.names=['key1', 'key2']
frame.columns.names=['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [101]:
frame.index.nlevels

2

In [103]:
frame.columns.nlevels

2

In [105]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [107]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [109]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [111]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [113]:
frame.groupby(level='key2').sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [115]:
frame.groupby(level='color', axis='columns').sum()

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [119]:
frame = pd.DataFrame(
    {
        'a' : range(7), 'b' : range(7,0,-1),
        'c' : ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
        'd' : [0, 1, 2, 0, 1, 2, 3]
    }
)

frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [121]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [123]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [125]:
frame.reset_index()

   index  a  b    c  d
0      0  0  7  one  0
1      1  1  6  one  1
2      2  2  5  one  2
3      3  3  4  two  0
4      4  4  3  two  1
5      5  5  2  two  2
6      6  6  1  two  3

In [129]:
df1 = pd.DataFrame({
    'key' : ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data1' : pd.Series(range(7), dtype='Int64')
})

df2 = pd.DataFrame({
    'key' : ['a', 'b', 'd'],
    'data2' : pd.Series(range(3), dtype='Int64')
})

df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [131]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [133]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [135]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [139]:
df3 = pd.DataFrame({
    'lkey' : ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data1' : pd.Series(range(7), dtype='Int64')
                        })
df4 = pd.DataFrame({
    'rkey' : ['a', 'b', 'd'],
    'data2' : pd.Series(range(3), dtype='Int64')
})
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [141]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [143]:
pd.merge(df3, df4, left_on = 'lkey', right_on = 'rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [145]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0
6   c      3   <NA>
7   d   <NA>      2

In [147]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey', how='outer')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0
6    c      3  NaN   <NA>
7  NaN   <NA>    d      2

In [151]:
df1 = pd.DataFrame({
    'key' : ['b', 'b', 'a', 'c', 'a', 'b'],
    'data1' : pd.Series(range(6), dtype='Int64')
                        })
df2 = pd.DataFrame({
    'key' : ['a', 'b', 'a', 'b', 'd'],
    'data2' : pd.Series(range(5), dtype='Int64')
})

df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [153]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [155]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      1      1
3    b      1      3
4    a      2      0
5    a      2      2
6    c      3   <NA>
7    a      4      0
8    a      4      2
9    b      5      1
10   b      5      3

In [157]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [163]:
left = pd.DataFrame({
    'key1' : ['foo', 'foo', 'bar'],
    'key2' : ['one', 'two', 'one'],
    'lval' : pd.Series([1,2,3], dtype='Int64')
})
right = pd.DataFrame({
    'key1' : ['foo', 'foo', 'bar', 'bar'],
    'key2' : ['one', 'one', 'one', 'two'],
    'rval' : pd.Series([4,5,6,7], dtype='Int64')
})
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [165]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [167]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  foo  two     2  <NA>
3  bar  one     3     6
4  bar  two  <NA>     7

In [171]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [173]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [177]:
left1 = pd.DataFrame({
    'key' : ['a', 'b', 'a', 'a', 'b', 'c'],
    'value' : pd.Series(range(6), dtype='Int64')
})

right1 = pd.DataFrame({
    'group_val' : [3.5, 7]}, 
    index=['a', 'b']
)
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [179]:
right1

   group_val
a        3.5
b        7.0

In [181]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [183]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [197]:
lefth = pd.DataFrame({
    'key1' : ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
    'key2' : [2000, 2001, 2002, 2001, 2002],
    'data' : pd.Series(range(5), dtype='Int64')
})

righth_index = pd.MultiIndex.from_arrays(
    [
        ['Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio', 'Ohio'],
        [2001, 2000, 2000, 2000, 2001, 2002]
    ]
)

righth = pd.DataFrame({
    'event1' : pd.Series([0, 2, 4, 6, 8, 10], dtype='Int64', index=righth_index),
    'event2' : pd.Series([1, 3, 5, 7, 9, 11], dtype='Int64', index=righth_index)
})

lefth

     key1  key2  data
0    Ohio  2000     0
1    Ohio  2001     1
2    Ohio  2002     2
3  Nevada  2001     3
4  Nevada  2002     4

In [199]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [203]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000     0       4       5
0    Ohio  2000     0       6       7
1    Ohio  2001     1       8       9
2    Ohio  2002     2      10      11
3  Nevada  2001     3       0       1

In [205]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000     0       4       5
0    Ohio  2000     0       6       7
1    Ohio  2001     1       8       9
2    Ohio  2002     2      10      11
3  Nevada  2001     3       0       1
4  Nevada  2002     4    <NA>    <NA>
4  Nevada  2000  <NA>       2       3

In [209]:
left2 = pd.DataFrame(
    [[1., 2.], [3., 4.], [5., 6.]],
    index=['a', 'c', 'e'],
    columns=['Ohio', 'Nevada']).astype('Int64')
right2 = pd.DataFrame(
    [[7., 8.], [9., 10.], [11., 12.], [13., 14.]],
    index=['b', 'c', 'd', 'e'],
    columns=['Missouri', 'Alabama']).astype('Int64')

left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [211]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [213]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a     1       2      <NA>     <NA>
b  <NA>    <NA>         7        8
c     3       4         9       10
d  <NA>    <NA>        11       12
e     5       6        13       14

In [215]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [217]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a     1       2      <NA>     <NA>
b  <NA>    <NA>         7        8
c     3       4         9       10
d  <NA>    <NA>        11       12
e     5       6        13       14

In [219]:
another = pd.DataFrame(
    [[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
    index=['a', 'c', 'e','f'],
    columns=['New York', 'Oregon'])

another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [223]:
left2.join([right2,another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2      <NA>     <NA>       7.0     8.0
c     3       4         9       10       9.0    10.0
e     5       6        13       14      11.0    12.0

In [227]:
left2.join([right2, another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2      <NA>     <NA>       7.0     8.0
c     3       4         9       10       9.0    10.0
e     5       6        13       14      11.0    12.0
b  <NA>    <NA>         7        8       NaN     NaN
d  <NA>    <NA>        11       12       NaN     NaN
f  <NA>    <NA>      <NA>     <NA>      16.0    17.0

In [229]:
arr = np.arange(12).reshape((3,4,))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [231]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [237]:
s1 = pd.Series([0, 1], index=['a',  'b'], dtype='Int64')
s2 = pd.Series([2, 3, 4], index=['c',  'd', 'e'], dtype='Int64')
s3 = pd.Series([5, 6], index=['f', 'g'], dtype='Int64')
s1

a    0
b    1
dtype: Int64

In [239]:
s2

c    2
d    3
e    4
dtype: Int64

In [241]:
s3

f    5
g    6
dtype: Int64

In [243]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: Int64

In [253]:
s4 = pd.concat([s1, s3])

In [251]:
pd.concat([s1, s3], axis='columns')

      0     1
a     0  <NA>
b     1  <NA>
f  <NA>     5
g  <NA>     6

In [255]:
pd.concat([s1, s4], axis='columns', join='inner')

   0  1
a  0  0
b  1  1

In [261]:
result=pd.concat([s1, s2, s3], keys=['one', 'two', 'three'])
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: Int64

In [263]:
result.unstack()

          a     b     c     d     e     f     g
one       0     1  <NA>  <NA>  <NA>  <NA>  <NA>
two    <NA>  <NA>     2     3     4  <NA>  <NA>
three  <NA>  <NA>  <NA>  <NA>  <NA>     5     6

In [267]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2), index=['a', 'b', 'c'], columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2,2), index=['a', 'c'], columns=['three', 'four'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [269]:
df2

   three  four
a      5     6
c      7     8

In [271]:
pd.concat([df1, df2], axis='columns', keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [273]:
pd.concat({'level1': df1, 'level2': df2}, axis='columns')

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [275]:
pd.concat([df1, df2], axis='columns', keys=['level1', 'level2'], names=['upper', 'lower'])

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [279]:
df1 = pd.DataFrame(np.random.standard_normal((3,4)), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.standard_normal((2,3)), columns=[ 'b', 'd', 'a'])
df1

          a         b         c         d
0 -0.628273  0.783853 -0.583663  1.536225
1 -0.049146 -1.816835 -0.949239  0.552826
2  0.022014 -1.059022  1.330400 -0.316988

In [281]:
df2

          b         d         a
0  0.070499 -1.448598  2.369594
1 -1.350849 -0.578655  0.929362

In [283]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0 -0.628273  0.783853 -0.583663  1.536225
1 -0.049146 -1.816835 -0.949239  0.552826
2  0.022014 -1.059022  1.330400 -0.316988
3  2.369594  0.070499       NaN -1.448598
4  0.929362 -1.350849       NaN -0.578655

In [287]:
a = pd.Series([np.nan, 2.5, 0.0, 3.5, 4.5, np.nan],
          index=['f', 'e', 'd', 'c', 'b','a'])

b = pd.Series([0., np.nan, 2., np.nan, np.nan, 5.],
              index=['a', 'b', 'c', 'd', 'e', 'f'])
a

f    NaN
e    2.5
d    0.0
c    3.5
b    4.5
a    NaN
dtype: float64

In [289]:
b

a    0.0
b    NaN
c    2.0
d    NaN
e    NaN
f    5.0
dtype: float64

In [291]:
np.where(pd.isna(a), b, a)

array([0. , 2.5, 0. , 3.5, 4.5, 5. ])

In [293]:
a.combine_first(b)

a    0.0
b    4.5
c    3.5
d    0.0
e    2.5
f    5.0
dtype: float64

In [297]:
pd.DataFrame({
    'a' : [1., np.nan, 5., np.nan],
    'b' : [np.nan, 2., np.nan, 6.],
    'c' : range(2, 18, 4)
})

df2 = pd.DataFrame({
    'a' : [5., 4., np.nan, 3., 7.],
    'b' : [np.nan, 3., 4., 6., 8.]
})
df1

          a         b         c         d
0 -0.628273  0.783853 -0.583663  1.536225
1 -0.049146 -1.816835 -0.949239  0.552826
2  0.022014 -1.059022  1.330400 -0.316988

In [299]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [301]:
df1.combine_first(df2)

          a         b         c         d
0 -0.628273  0.783853 -0.583663  1.536225
1 -0.049146 -1.816835 -0.949239  0.552826
2  0.022014 -1.059022  1.330400 -0.316988
3  3.000000  6.000000       NaN       NaN
4  7.000000  8.000000       NaN       NaN

In [305]:
data = pd.DataFrame(np.arange(6).reshape((2,3)),
             index=pd.Index(['Ohio', 'Colorado'], name='state'),
             columns=pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [307]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [309]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [311]:
result.unstack(level=0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [315]:
result.unstack(level='state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [321]:
s1 = pd.Series([0, 1,2,3], index=['a',  'b', 'c', 'd'], dtype='Int64')
s2 = pd.Series([4, 5, 6], index=['c',  'd', 'e'], dtype='Int64')
s3 = pd.Series([5, 6], index=['f', 'g'], dtype='Int64')

In [323]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: Int64

In [325]:
data2.unstack()

        a     b  c  d     e
one     0     1  2  3  <NA>
two  <NA>  <NA>  4  5     6

In [327]:
data2.unstack().stack()

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: Int64

In [329]:
data2.unstack().stack(dropna=False)

one  a       0
     b       1
     c       2
     d       3
     e    <NA>
two  a    <NA>
     b    <NA>
     c       4
     d       5
     e       6
dtype: Int64

In [331]:
df = pd.DataFrame({
    'left' : result,'right' : result + 5},
             columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [333]:
df.unstack(level='state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [335]:
df.unstack(level='state').stack(level='side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

In [17]:
data = pd.read_csv(r"C:\Users\user\Lesson\pydata-book-3rd-edition\examples\macrodata.csv")
data = data.loc[:, ['year', 'quarter', 'realgdp', 'infl', 'unemp']]
data.head()

   year  quarter   realgdp  infl  unemp
0  1959        1  2710.349  0.00    5.8
1  1959        2  2778.801  2.34    5.1
2  1959        3  2775.488  2.74    5.3
3  1959        4  2785.204  0.27    5.6
4  1960        1  2847.699  2.31    5.2

In [19]:
periods = pd.PeriodIndex(
    year=data.pop('year'),
    quarter=data.pop('quarter'),
    name='date'
)
periods

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203)

In [21]:
data.index = periods.to_timestamp('D')
data.head()

             realgdp  infl  unemp
date
1959-01-01  2710.349  0.00    5.8
1959-04-01  2778.801  2.34    5.1
1959-07-01  2775.488  2.74    5.3
1959-10-01  2785.204  0.27    5.6
1960-01-01  2847.699  2.31    5.2

In [23]:
data = data.reindex(columns=['realgdp', 'infl', 'unemp'])
data.columns.name='item'
data.head()

item         realgdp  infl  unemp
date
1959-01-01  2710.349  0.00    5.8
1959-04-01  2778.801  2.34    5.1
1959-07-01  2775.488  2.74    5.3
1959-10-01  2785.204  0.27    5.6
1960-01-01  2847.699  2.31    5.2

In [25]:
long_data = (
    data.stack().reset_index().rename(columns={0: 'value'})
)

In [27]:
long_data[:10]

        date     item     value
0 1959-01-01  realgdp  2710.349
1 1959-01-01     infl     0.000
2 1959-01-01    unemp     5.800
3 1959-04-01  realgdp  2778.801
4 1959-04-01     infl     2.340
5 1959-04-01    unemp     5.100
6 1959-07-01  realgdp  2775.488
7 1959-07-01     infl     2.740
8 1959-07-01    unemp     5.300
9 1959-10-01  realgdp  2785.204

In [33]:
pivoted = long_data.pivot(index='date', columns='item', values='value')
pivoted.head()

item        infl   realgdp  unemp
date
1959-01-01  0.00  2710.349    5.8
1959-04-01  2.34  2778.801    5.1
1959-07-01  2.74  2775.488    5.3
1959-10-01  0.27  2785.204    5.6
1960-01-01  2.31  2847.699    5.2

In [37]:
long_data.index.name = None
long_data['value2'] = np.random.standard_normal(len(long_data))
long_data[:10]

        date     item     value    value2
0 1959-01-01  realgdp  2710.349 -0.574076
1 1959-01-01     infl     0.000  0.114734
2 1959-01-01    unemp     5.800  0.446809
3 1959-04-01  realgdp  2778.801  1.976737
4 1959-04-01     infl     2.340 -0.627711
5 1959-04-01    unemp     5.100 -0.687231
6 1959-07-01  realgdp  2775.488 -1.175470
7 1959-07-01     infl     2.740  0.896174
8 1959-07-01    unemp     5.300  1.332711
9 1959-10-01  realgdp  2785.204  0.942857

In [41]:
pivoted = long_data.pivot(index='date', columns='item')
pivoted.head()

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-01-01  0.00  2710.349   5.8  0.114734 -0.574076  0.446809
1959-04-01  2.34  2778.801   5.1 -0.627711  1.976737 -0.687231
1959-07-01  2.74  2775.488   5.3  0.896174 -1.175470  1.332711
1959-10-01  0.27  2785.204   5.6 -0.369446  0.942857 -0.264479
1960-01-01  2.31  2847.699   5.2  1.072032  0.220386  0.399146

In [43]:
pivoted['value'].head()

item        infl   realgdp  unemp
date
1959-01-01  0.00  2710.349    5.8
1959-04-01  2.34  2778.801    5.1
1959-07-01  2.74  2775.488    5.3
1959-10-01  0.27  2785.204    5.6
1960-01-01  2.31  2847.699    5.2

In [47]:
unstacked = long_data.set_index(['date', 'item']).unstack(level='item')
unstacked.head()

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-01-01  0.00  2710.349   5.8  0.114734 -0.574076  0.446809
1959-04-01  2.34  2778.801   5.1 -0.627711  1.976737 -0.687231
1959-07-01  2.74  2775.488   5.3  0.896174 -1.175470  1.332711
1959-10-01  0.27  2785.204   5.6 -0.369446  0.942857 -0.264479
1960-01-01  2.31  2847.699   5.2  1.072032  0.220386  0.399146

In [49]:
df = pd.DataFrame({
    'key' : ['foo', 'bar', 'bax'],
    'A' : [1,2,3],
    'B' : [4,5,6],
    'C' : [7,8,9]
})
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  bax  3  6  9

In [53]:
melted = pd.melt(df, id_vars='key')
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  bax        A      3
3  foo        B      4
4  bar        B      5
5  bax        B      6
6  foo        C      7
7  bar        C      8
8  bax        C      9

In [55]:
reshaped = melted.pivot(index='key', columns='variable', values='value')
reshaped

variable  A  B  C
key
bar       2  5  8
bax       3  6  9
foo       1  4  7

In [57]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         bax  3  6  9
2         foo  1  4  7

In [59]:
pd.melt(df, id_vars='key', value_vars=['A', 'B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  bax        A      3
3  foo        B      4
4  bar        B      5
5  bax        B      6

In [61]:
pd.melt(df, value_vars=['A', 'B', 'C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [63]:
pd.melt(df, value_vars=['key', 'A', 'B'])

  variable value
0      key   foo
1      key   bar
2      key   bax
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6